Public Attributes | List of all members
API_BeamQuantity Struct Reference
Element Manager API
Describes the different calculated values for beams. More...
#include <APIdefs_Elements.h>
 Public Attributes
double  | area
area of the beam
double  | rightLength
length of the beam on the right side of the reference line
double  | leftLength
length of the beam on the left side of the reference line
double  | bottomSurface
surface of the bottom of the beam
double  | topSurface
surface of the top of the beam
double  | edgeSurfaceLeft
surface of the beam on the left side of the reference line
double  | edgeSurfaceRight
surface of the beam on the right side of the reference line
double  | edgeSurface
surface of both ends of the beam
double  | holesSurface
total surface of holes in the beam
double  | holesEdgeSurface
total surface of hole edges in the beam
Int32  | holesNumber
number of holes in the beam
double  | crossSectionAreaCutBegin
area of the beams begin cross section
double  | crossSectionAreaCutEnd
area of the beams end cross section
double  | volume
volume of the beam
double  | volume_cond
conditional volume of the beam
double  | holesVolume
total volume of holes in the beam
Detailed Description
Describes the different calculated values for beams.
Remarks
See also the beam parameters for listing in Appendix A of the GDL Reference manual.
Member Data Documentation
◆ area
 API_BeamQuantity::area
area of the beam
◆ bottomSurface
 API_BeamQuantity::bottomSurface
surface of the bottom of the beam
◆ crossSectionAreaCutBegin
 API_BeamQuantity::crossSectionAreaCutBegin
area of the beams begin cross section
◆ crossSectionAreaCutEnd
 API_BeamQuantity::crossSectionAreaCutEnd
area of the beams end cross section
◆ edgeSurface
 API_BeamQuantity::edgeSurface
surface of both ends of the beam
◆ edgeSurfaceLeft
 API_BeamQuantity::edgeSurfaceLeft
surface of the beam on the left side of the reference line
◆ edgeSurfaceRight
 API_BeamQuantity::edgeSurfaceRight
surface of the beam on the right side of the reference line
◆ holesEdgeSurface
 API_BeamQuantity::holesEdgeSurface
total surface of hole edges in the beam
◆ holesNumber
 API_BeamQuantity::holesNumber
number of holes in the beam
◆ holesSurface
 API_BeamQuantity::holesSurface
total surface of holes in the beam
◆ holesVolume
 API_BeamQuantity::holesVolume
total volume of holes in the beam
◆ leftLength
 API_BeamQuantity::leftLength
length of the beam on the left side of the reference line
◆ rightLength
 API_BeamQuantity::rightLength
length of the beam on the right side of the reference line
◆ topSurface
 API_BeamQuantity::topSurface
surface of the top of the beam
◆ volume
 API_BeamQuantity::volume
volume of the beam
◆ volume_cond
 API_BeamQuantity::volume_cond
conditional volume of the beam